vageeshgaonkar1-git/Vehicle_Emission_Monitor_Embedded/stm32/main.c
    /* Transmit over UART2 → ESP32 GPIO16 (RX2) */
    HAL_UART_Transmit(&huart2, (uint8_t *)frame, (uint16_t)len, 100);
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  Purge → Settle → Sample state machine
 *  Cycle: 15s fan ON (purge) + 10s fan OFF (settle) + sample = 25s total
 *  Vibration is polled every 1s during settle so engine-on events are not
 *  missed during the blocking delay windows.
 * ═══════════════════════════════════════════════════════════════════════════ */
static void run_state_machine(void)
{
    /* ── PURGE: fan ON for PURGE_MS ── */
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
    HAL_Delay(PURGE_MS);

    /* ── SETTLE: fan OFF, poll vibration every 1 s ── */
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);

    int is_running    = 0;
    int vib_count     = 0;
    uint32_t settle_ticks = SETTLE_MS / 1000U;
    for (uint32_t i = 0; i < settle_ticks; i++) {
        HAL_Delay(1000);
        if (mpu6050_is_running()) {
            vib_count++;
        }
    }
    /* Report engine running if vibration detected in at least 1 of the polls */
    if (vib_count >= 1) is_running = 1;

    /* ── SAMPLE: read all sensors at end of settle phase ── */
    float temperature = 25.0f;
    float humidity    = 50.0f;
    dht22_read(&temperature, &humidity);

    uint16_t raw_co  = adc_read_channel(ADC_CHANNEL_0);
    uint16_t raw_nox = adc_read_channel(ADC_CHANNEL_1);

    /* MQ-7 on PA0 → CO in ppm, MQ-135 on PA1 → NOx/air quality in ppm */
    float co  = mq7_read_ppm(raw_co,   temperature, humidity);
    float nox = mq135_read_ppm(raw_nox, temperature, humidity);

    char timestamp[32];
    if (ds3231_get_timestamp(timestamp, sizeof(timestamp)) != HAL_OK) {
        timestamp[0] = '\0';
    }

    transmit_frame(co, nox, temperature, humidity, is_running, timestamp);
}

/* ═══════════════════════════════════════════════════════════════════════════
 *  System clock — STM32F411CEU6 at 96 MHz
 *  HSE 25 MHz (Black Pill crystal) → PLL → 96 MHz SYSCLK
 *  USB requires a 48 MHz clock: PLLQ = 4 → 96/4 = 48 MHz ✓
 * ═══════════════════════════════════════════════════════════════════════════ */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef osc = {0};
    osc.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    osc.HSEState       = RCC_HSE_ON;
    osc.PLL.PLLState   = RCC_PLL_ON;
    osc.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    osc.PLL.PLLM       = 25;   /* 25 MHz HSE / 25 = 1 MHz VCO input  */
    osc.PLL.PLLN       = 192;  /* × 192 = 192 MHz VCO                */
    osc.PLL.PLLP       = RCC_PLLP_DIV2;  /* 192 / 2 = 96 MHz SYSCLK */
    osc.PLL.PLLQ       = 4;    /* 192 / 4 = 48 MHz USB clock ✓       */
    HAL_RCC_OscConfig(&osc);

    RCC_ClkInitTypeDef clk = {0};
    clk.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                       | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clk.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    clk.AHBCLKDivider  = RCC_SYSCLK_DIV1;   /* HCLK  = 96 MHz */
    clk.APB1CLKDivider = RCC_HCLK_DIV2;     /* PCLK1 = 48 MHz (max for F411) */
    clk.APB2CLKDivider = RCC_HCLK_DIV1;     /* PCLK2 = 96 MHz */
    HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_3);
}
